/*
說明
請輸入2整數m與n
印出m*n之九九乘法表(每筆輸出後有一空白字元)
每筆資料的乘數與被乘數都只佔一格
乘積 佔2格並靠右對齊

Input Format
n
m

Output Format
被乘數*乘數=乘積(佔2格並靠右對齊)[空白]

Sample Input
5
8
Sample Output
1*1= 1 1*2= 2 1*3= 3 1*4= 4 1*5= 5 1*6= 6 1*7= 7 1*8= 8
2*1= 2 2*2= 4 2*3= 6 2*4= 8 2*5=10 2*6=12 2*7=14 2*8=16
3*1= 3 3*2= 6 3*3= 9 3*4=12 3*5=15 3*6=18 3*7=21 3*8=24
4*1= 4 4*2= 8 4*3=12 4*4=16 4*5=20 4*6=24 4*7=28 4*8=32
5*1= 5 5*2=10 5*3=15 5*4=20 5*5=25 5*6=30 5*7=35 5*8=40
Hint
本題輸出的答案要空2格，使用Python的同學要到學習「字串」章節，學會格式化輸出後，做這一題才比較容易些，其實格式化輸出算是 Level 1 輸入與輸出的內容，但完整的格式化較化復雜，所以移到「字串」章節才教，做此題的同學可以先預習字串的章節的格式化輸出的部份會比較好做，若不用格式化的話也可自行用判斷式判斷輸出位數為一位或兩位。
*/

#include <iostream>
#include <string>
#include <cmath>
using namespace std;

int main(void){
    int n, m, mul;
    cin >> n;
    cin >> m;

    for(int i=1; i<=n; i++){
        for(int j=1; j<=m; j++){
            mul = i * j;
            if(mul / 10 == 0){
                cout << i << "*" << j << "= " << mul;
            }
            else{
                cout << i << "*" << j << "=" << mul;
            }
            cout << " ";
        }
        cout << endl;
    }
    
    return 0;
}